#    -*- mode: org -*-

#+Title: Lección 1 --- Producción de cemento
#+author: Marcos Bujosa
#+LANGUAGE: es
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+OPTIONS: date:nil

# +PROPERTY: header-args :tangle ./guiones/lecc01-airlinePass.inp

#+OPTIONS: :eval yes
#+PROPERTY: header-args :eval yes

#+INFOJS_OPT: view:overview

# ###########
# ESTO DA EL FORMATO FINAL DE LA PÁGINA WEB VÉASE [[https://olmon.gitlab.io/org-themes/]]
#+SETUPFILE: ../css/bigblow_inline.theme
# ###########

#+latex_class_options: [10pt]

#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
# +LaTeX_HEADER: \usepackage{framed}
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}

#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent :tangle no
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src


* Actividad 1 - Análisis de error de carga de los datos

Gretl espera un fichero formado por columnas y donde la primera fila contiene los nombres (entre comillas) de cada una de las columnas. El resto de filas solo contienen datos numéricos. Si hay datos ausentes, Gretl espera que esté indicado con ~NA~.

Sin embargo el fichero =be3211.csv= que hemos descargado:
- tiene 6 filas con información no numérica.
- Los datos ausentes están marcados con ="_"=:

#+BEGIN_SRC sh :results table drawer :exports results
head -n 9 ../datos/be2311-original.csv | iconv -f iso-8859-1 -t utf-8 
#+END_SRC

#+RESULTS:
:results:
| CÓDIGO DE LA SERIE          | D_1ID10000                                          | D_1KC02000                                   | D_1KC01000                                   | D_1KC06000                                        | D_1IE00000                                    | D_1KB22000                                       | D_1KB21000                                       | D_1KB23000                                          |
| NÚMERO SECUENCIAL           | 247145                                              | 247556                                       | 247555                                       | 247560                                            | 247150                                        | 247550                                           | 247549                                           | 247551                                              |
| ALIAS DE LA SERIE           | BE_23_11.1                                          | BE_23_11.2                                   | BE_23_11.3                                   | BE_23_11.4                                        | BE_23_11.5                                    | BE_23_11.6                                       | BE_23_11.7                                       | BE_23_11.8                                          |
| DESCRIPCIÓN DE LA SERIE     | Estadísticas generales. Producción interna de acero | Estadísticas generales. Exportación de acero | Estadísticas generales. Importación de acero | Estadísticas generales. Disponibilidades de acero | Estadísticas generales. Producción de cemento | Estadísticas generales. Exportaciones de cemento | Estadísticas generales. Importaciones de cemento | Estadísticas Generales. Consumo aparente de cemento |
| DESCRIPCIÓN DE LAS UNIDADES | Miles de toneladas métricas                         | Miles de toneladas métricas                  | Miles de toneladas métricas                  | Miles de toneladas métricas                       | Miles de toneladas métricas                   | Miles de toneladas métricas                      | Miles de toneladas métricas                      | Miles de toneladas métricas                         |
| FRECUENCIA                  | MENSUAL                                             | MENSUAL                                      | MENSUAL                                      | MENSUAL                                           | MENSUAL                                       | MENSUAL                                          | MENSUAL                                          | MENSUAL                                             |
| ENE 1955                    | _                                                   | _                                            | _                                            | _                                                 | 282.0                                         | _                                                | _                                                | _                                                   |
| FEB 1955                    | _                                                   | _                                            | _                                            | _                                                 | 262.0                                         | _                                                | _                                                | _                                                   |
| MAR 1955                    | _                                                   | _                                            | _                                            | _                                                 | 296.0                                         | _                                                | _                                                | _                                                   |
:end:


- Y las dos últimas filas también contienen información no numérica sobre los datos:

#+BEGIN_SRC sh :results table drawer  :exports results
tail -n 5 ../datos/be2311-original.csv | iconv -f iso-8859-1 -t utf-8
#+END_SRC

#+RESULTS:
:results:
| ABR 2025 | _                                                   | _                                            | _                                            | _                                                 |                                       1434.52 |                                           246.75 |                                           52.812 |                                             1240.89 |
| MAY 2025 | _                                                   | _                                            | _                                            | _                                                 |                                       1617.17 |                                          284.805 |                                           53.084 |                                             1408.22 |
| JUN 2025 | _                                                   | _                                            | _                                            | _                                                 |                                       1712.92 |                                          299.159 |                                           53.873 |                                             1410.96 |
| FUENTE   | UNESID                                              | UNESID                                       | UNESID                                       | UNESID                                            |             Ministerio de Industria y Turismo |                Ministerio de Industria y Turismo |                Ministerio de Industria y Turismo |                   Ministerio de Industria y Turismo |
| NOTAS    | Estadísticas generales. Producción interna de acero | Estadísticas generales. Exportación de acero | Estadísticas generales. Importación de acero | Estadísticas generales. Disponibilidades de acero | Estadísticas generales. Producción de cemento | Estadísticas generales. Exportaciones de cemento | Estadísticas generales. Importaciones de cemento | Estadísticas Generales. Consumo aparente de cemento |
:end:


Otros problemas que pueden surgir se deben a las distintas codificaciones de los ficheros en las bases de datos (=iso-latin-1-dos=, =utf-8-unix=, etc.), que afectan a como se interpretan los caracteres no ASCII (acentos, eñes, etc.) en cada sistema operativo. 

* Actividad 2 - Depuración del fichero =.csv= y lectura de los datos

- Borre las tres primeras líneas de texto (la que empieza con CÓDIGO, la que empieza con NÚMERO y la que empieza con ALIAS). 
- En la cuarta línea cambie ="DESCRIPCIÓN DE LA SERIE"= por ="Fechas"= (como cabecera de la primera columna; que contiene la indicación del mes de cada dato).
- Acorte los nombres de la series borrando las cadenas de texto =Estadísticas generales._= en todos los nombres de las series:
  + Así por ejemplo `` =Estadísticas generales. Producción interna de acero= '' debe quedar como `` =Producción interna de acero= ''.
  + Repita esto con los nombres de todas las series (tal como aparecen son demasiado largos para que se visualicen correctamente en Gretl).
- Borre las dos líneas siguientes: la que describe las =UNIDADES= y la que describe la ="FRECUENCIA"=
- Borre también las dos últimas líneas del fichero: La que empieza con ="FUENTE"= y la que empieza con ="NOTAS"= al final del fichero.
- Sustituya todos los ="_"=  por =NA= (son muchos... hágalo usando la herramienta de sustitución de cadenas de texto que ofrezca su editor de texto).
- Guarde el fichero =be2311.csv= con todas esas modificaciones.

Ahora el comienzo de su fichero es:

#+BEGIN_SRC sh :results table drawer  :exports results
head -n 3 ../datos/be2311.csv | iconv -f iso-8859-1 -t utf-8
#+END_SRC

#+RESULTS:
:results:
| Fechas   | Producción interna de acero | Exportación de acero | Importación de acero | Disponibilidades de acero | Producción de cemento | Exportaciones de cemento | Importaciones de cemento | Estadísticas Generales. Consumo aparente de cemento |
| ENE 1955 | NA                          | NA                   | NA                   | NA                        |                 282.0 | NA                       | NA                       | NA                                                  |
| FEB 1955 | NA                          | NA                   | NA                   | NA                        |                 262.0 | NA                       | NA                       | NA                                                  |
:end:

Y las filas finales solo contienen datos numéricos (exceptuando la primera columna):

#+BEGIN_SRC sh :results table drawer  :exports results
tail -n 3 ../datos/be2311.csv  | iconv -f iso-8859-1 -t utf-8
#+END_SRC

#+RESULTS:
:results:
| ABR 2025 | NA | NA | NA | NA | 1434.52 |  246.75 | 52.812 | 1240.89 |
| MAY 2025 | NA | NA | NA | NA | 1617.17 | 284.805 | 53.084 | 1408.22 |
| JUN 2025 | NA | NA | NA | NA | 1712.92 | 299.159 | 53.873 | 1410.96 |
:end:

Además, los valores ausentes están indicados con ~NA~.

